flow-through-channel/fluid-openfoam-vortex-shedding/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(

    (-0.5 0.25 0) //0
    (0 0.25 0) //1
    (0 0.65 0) //2
    (-0.5 0.65 0) //3
    (-0.5 0.25 0.4) //4
    (0 0.25 0.4) //5
    (0 0.65 0.4) //6
    (-0.5 0.65 0.4) //7

    (-0.5 0.85 0) //8
    (0 0.85 0) //9
    (0 1.25 0) //10
    (-0.5 1.25 0) //11
    (-0.5 0.85 0.4) //12
    (0 0.85 0.4) //13
    (0 1.25 0.4) //14
    (-0.5 1.25 0.4) //15

    (3 0.25 0) //16
    (3.2 0.25 0) //17
    (3.2 0.74 0) //18
    (3 0.55 0) //19
    (3 0.25 0.4) //20
    (3.2 0.25 0.4) //21
    (3.2 0.74 0.4) //22
    (3 0.55 0.4) //23

    (3 0.95 0) //24
    (3.2 0.76 0) //25
    (3.2 1.25 0) //26
    (3 1.25 0) //27
    (3 0.95 0.4) //28
    (3.2 0.76 0.4) //29
    (3.2 1.25 0.4) //30
    (3 1.25 0.4) //31

    (4 0.25 0) //32
    (6 0.25 0) //33
    (6 0.65 0) //34
    (4 0.65 0) //35
    (4 0.25 0.4) //36
    (6 0.25 0.4) //37
    (6 0.65 0.4) //38
    (4 0.65 0.4) //39

    (4 0.85 0) //40
    (6 0.85 0) //41
    (6 1.25 0) //42
    (4 1.25 0) //43
    (4 0.85 0.4) //44
    (6 0.85 0.4) //45
    (6 1.25 0.4) //46
    (4 1.25 0.4) //47

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (41 41 4) simpleGrading (.5 15 1)
    hex (3 2 9 8 7 6 13 12) (41 11 4) simpleGrading (.5 1 1)
    hex (8 9 10 11 12 13 14 15) (41 41 4) simpleGrading (.5 15 1)

    hex (1 16 19 2 5 20 23 6) (161 41 4) simpleGrading (2 15 1)
    hex (2 19 24 9 6 23 28 13) (161 11 4) simpleGrading (2 1 1)
    hex (9 24 27 10 13 28 31 14) (161 41 4) simpleGrading (2 15 1)

    hex (16 17 18 19 20 21 22 23) (16 41 4) simpleGrading (1 15 1)
    hex (24 25 26 27 28 29 30 31) (16 41 4) simpleGrading (1 15 1)

    hex (17 32 35 18 21 36 39 22) (61 41 4) simpleGrading (2 15 1)
    hex (18 35 40 25 22 39 44 29) (61 11 4) simpleGrading (2 1 1)
    hex (25 40 43 26 29 44 47 30) (61 41 4) simpleGrading (2 15 1)

    hex (32 33 34 35 36 37 38 39) (61 41 4) simpleGrading (1 15 1)
    hex (35 34 41 40 39 38 45 44) (61 11 4) simpleGrading (1 1 1)
    hex (40 41 42 43 44 45 46 47) (61 41 4) simpleGrading (1 15 1)
);

boundary
(

    inlet
    {
        type wall;
        faces
        (
        	(3 0 4 7)
            (8 3 7 12)
            (11 8 12 15)
        );
    }

    outlet
    {
        type wall;
        faces
        (
        	(33 34 38 37)
            (34 41 45 38)
            (41 42 46 45)
        );
    }

    slip-top
    {
        type wall;
        faces
        (
        	(11 10 14 15)
        );
    }

    top
    {
        type wall;
        faces
        (  	
            (42 43 47 46)
        );
    }

    slip-bottom
    {
        type wall;
        faces
        (
        	(4 0 1 5)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (32 33 37 36)
        );
    }

    interface
    {
        type wall;
        faces
        (
        	(20 16 17 21)
            (31 30 26 27)
            (5 1 16 20)
            (10 27 31 14)
            (17 32 36 21)
            (43 26 30 47)
        );
    }

    flap
    {
        type wall;
        faces
        (
        	(18 19 23 22)
            (24 25 29 28)
            (19 24 28 23)
            (25 18 22 29)
        );
    }

);
